Week6/Day1/sandwichr_pair_programming/app/controllers/sandwich_views_controller.rb

SELECT "sandwiches".* FROM "sandwiches"
---
	def index
	   @sandwiches = Sandwich.all

SELECT  "sandwiches".* FROM "sandwiches" WHERE "sandwiches"."id" = ? LIMIT 1  [["id", 1]]
---
	def show

	   fucksake = params[:id]
	   @view = Sandwich.find_by(id: fucksake)